{
  "version": "1.2",
  "settings": [
	{
      "id": "variab",
      "name": "Data Attribute",
      "description": "Insert the name of your selected attribute in the exact spelling as provided in your data set. If unsure, please run the App preceding this one in your workflow and check the Event Attributes in the Output Details overview.",
      "defaultValue": null,
      "type": "STRING"
    },
	{
      "id": "rel",
      "name": "Selection Relation",
      "description": "Choose how you want to filter the individual property variable you selected. (Note that ‘==’, ‘>’, or ‘<’ can only be used for numeric and timestamp variables.)",
      "defaultValue": null,
      "type": "RADIOBUTTONS",
      "options": [
        {
          "value": "%in%",
          "displayText": "is one of the following options (categorical option, e.g. sex (m, f))"
        },
		        {
          "value": "==",
          "displayText": "== (equals)"
        },
		        {
          "value": ">",
          "displayText": "> (is greater than)"
        },
		        {
          "value": "<",
          "displayText": "< (is less than)"
        }
      ]
	},
	{
      "id": "valu",
      "name": "Selection Value",
      "description": "Insert a value(s) for the attribute you have selected (categorical values must be comma-separated!). If it is a unit value make sure that the units match the input data. If you enter a timestamp, please ensure it is in UTC and follows the format ‘YYYY-mm-dd HH:MM:SS’. x",
      "defaultValue": null,
      "type": "STRING"
    },
	{
      "id": "time",
      "name": "Time variable?",
      "description": "Please check this box if your selected attribute is a timestamp. Please make sure that the timestamp is in UTC and follows the format 'YYYY-mm-dd HH:MM:SS'.",
      "defaultValue": false,
      "type": "CHECKBOX"
    },
	{
      "id": "delete",
      "name": "Delete event?",
      "description": "Select this option if you do not only want the attribute that fulfills the above defined property set to NA or another value (see below), but also want the complete events (locations) deleted from your data set. Default FALSE",
      "defaultValue": false,
      "type": "CHECKBOX"
    },
	{
      "id": "setto",
      "name": "Adapt value to",
      "description": "Insert a value to which the selected variable of your unrealistic events shall be set. Take care that the data type fits to the variable. There are three generic values that you can set: NULL (= NA (not available) default; then in future analysis steps these values will be ignored), 'median' (then your unrealistic event values will be set to the median of all other event values in the data) and 'mean' (then your unrealistic event values will be set to the mean of all other event values in the data). We advise to set values to NULL (NA), as other options are rather subjective.",
      "defaultValue": null,
      "type": "STRING"
    }
  ],
  "dependencies": {
    "R": [
      {
        "name": "move2"
      },
	  {
        "name": "units"
      }
    ]
  },
  "license": {
    "key": "MIT"
  },
  "language": "eng",
  "keywords": [
	"filter",
    "unrealistic",
	"attribute",
	"delete",
	"NA"
  ],
  "people": [
    {
      "firstName": "Andrea",
      "middleInitials": null,
      "lastName": "Kölzsch",
      "email": "akoelzsch@ab.mpg.de",
      "roles": ["compiler","author","creator"],
      "orcid": "0000-0003-0193-1563",
      "affiliation": "Max-Planck-Institute of Animal Behavior",
      "affiliationRor": "https://ror.org/026stee22"
    }
  ]
}
